/*
 * lscov - emoji table 
 * -------------------
 *  
 * Absolutely no reason. Just for sh*ts and giggles.
 * Courtesy of ASCIImoji. (https://asciimoji.com)
 */

#pragma once

#include <time.h>

static const char* emoji[] = {
  "( •_•)O*¯`·.¸.·´¯`°Q(•_• )",
  "ʕ •́؈•̀)",
  "(☝ ՞ਊ ՞)☝",
  "O=('-'Q)",
  "t(ಠ益ಠt)",
  "(ノಠ益ಠ)ノ彡┻━┻",
  "(=^･ｪ･^=))ﾉ彡☆",
  "ò_ô",
  "(◔_◔)",
  "(╯°□°)╯",
  "ε(´סּ︵סּ`)з",
  "( ͡° ʖ̯ ͡°)",
  "╚(•⌂•)╝",
  "¯\\_(ツ)_/¯",
  "ツ",
  "☺︎",
  "¬‿¬",
  "(;´༎ຶД༎ຶ`)",
  "ᕙ(⇀‸↼‶)ᕗ",
  "(๑•́ ヮ •̀๑)",
  "\\_(-_-)_/",
  "(̿▀̿‿ ̿▀̿ ̿)",
  "(ノ ゜Д゜)ノ ︵ ┻━┻",
  "(ಥ﹏ಥ)",
  "୧༼ಠ益ಠ༽︻╦╤─",
  "\\(^-^)/",
  "( ͡° ͜ʖ ͡°)_/¯",
  "|=-(¤)-=|",
  "(=____=)",
  "ᕦ(òᴥó)ᕥ",
  "(っ^з^)♪♬",
  "(°o•)",
  "WHΣИ $HΛLL WΣ †HЯΣΣ MΣΣ† ΛGΛ|И?",
  "＼(＾O＾)／",
  "(⊙＿⊙')",
  "⊙ω⊙",
  "\\( ﾟヮﾟ)/",
  "(•̀ᴗ•́)و ̑̑",
  "Yᵒᵘ Oᶰˡʸ Lᶤᵛᵉ Oᶰᶜᵉ",
  "⊹╰(⌣ʟ⌣)╯⊹",
  "[¬º-°]¬",
  " (̿▀̿ ̿Ĺ̯̿̿▀̿ ̿)̄",
  "(-(-_-(-_(-_(-_-)_-)-_-)_-)_-)-)",
  "(◡_◡)ᕤ",
  "вєωαяє, ι αм ƒαη¢у!",
  "(ง •̀_•́)ง",
  "ᕙ(`▽´)ᕗ",
  "ᕕ( ᐛ )ᕗ",
  "._.)/\\(._.",
  "(❍ᴥ❍ʋ)",
  "≧◡≦",
  "(づ ￣ ³￣)づ",
  "( ͡° ͜ʖ ͡°)",
  "(ง ͠° ͟ʖ ͡°)ง",
  "ᕦ( ͡° ͜ʖ ͡°)ᕤ",
  "¯\\_( ͡° ͜ʖ ͡°)_/¯",
  "ಠ_ಠ",
  "ʕ♥ᴥ♥ʔ",
  "ಡ_ಡ",
  "(⌐⊙_⊙)",
  "╚(•⌂•)╝",
  "(•_•) ( •_•)>⌐■-■ (⌐■_■)",
  "(ㆆ _ ㆆ)",
  "⊂(◉‿◉)つ",
};

static const char* random_goody() { 
  return emoji[time(NULL) % (sizeof(emoji)/sizeof(const char *))];
}
